/*Bubble sort е поедноставен алгоритам за сортирање. Составена е од сортиран и несортиран дел. При секое поминување на низата, секои два елементи се проверуваат и сортираат, движејќи го најголемииот елемент кон крајот на низата. Доколку два
соседни елементи не се на точните позиции се прави промена, во спротивно нема да има промена на местата. Кога во низата нема да има потреба од повеќе промени, таа е веќе сортирана.*/
//Simona Gjorgievska INKI956
#include<iostream>
using namespace std;
int main ()
{
   int i, j, temp, pass=0;
   int a[24] = {(int)'S',(int)'i',(int)'m',(int)'o',(int)'n',(int)'a',(int)'G',(int)'j',(int)'o',(int)'r',(int)'g',(int)'i',(int)'e',(int)'v',(int)'s',(int)'k',(int)'a',(int)'I',(int)'N',(int)'K',(int)'I',(int)'9',(int)'5',(int)'6'};
   
   cout <<"ASCII кодови...\n"; 
   for(i = 0; i<24 ; i++) {
      cout <<a[i]<<"\t";
   }
cout<<endl;
for(i =0; i<24; i++) {
   for(j = i+1; j<24; j++)
   {
      if(a[j] < a[i]) {
         temp = a[i];
         a[i] = a[j];
         a[j] = temp;
      }
   }
pass++;
}
cout <<"Сортирана листа...\n";  
for(i = 0; i<24; i++) {
   cout <<a[i]<<"\t";
}
cout<<"\nБрој на поминувања потребни за сортирање на низата:"<<pass<<endl;
return 0;
}